<?php

return [
    'dir'       => 'rtl',
    'cssFile'   => 'css-rtl',
    'thisLang'  => 'ar',
    'otherLang' => 'en',
    'langFlag'  => 'ae',
    'arabic'    => 'العربية',
    'english'   => 'English',
    'japanese'  => '日本語',

    "dashboard"        => "لوحة التحكم",
    "users_management" => "إدارة المستخدمين",
    "general_settings" => "أقسام العامة",
    "settings"         => "الإعدادات",

    "users" => [
        'index'  => 'الموظفين',
        "create" => "إضافة موظف جديد",
        "edit"   => "تعديل موظف",
        "show"   => "عرض موظف",
    ],

    "admins" => [
        'index' => 'المشرفين',
        "create" => "إضافة مشرف جديد",
        "edit" => "تعديل المشرف",
        "show" => "عرض المشرف",
    ],

    "notifications" => [
        'index' => 'الإشعارات',
        'readAll' => 'قراءة الكل',
        'notificationDetails' => 'تفاصيل الإشعار',
    ],

    "teams" => [
        'index'  => 'الأقسام',
        "create" => "إضافة قسم جديد",
        "edit"   => "تعديل القسم",
        "show"   => "عرض القسم",
    ],

    "projects" => [
        'index'  => 'المشاريع',
        "create" => "إضافة مشروع جديد",
        "edit"   => "تعديل المشروع",
        "show"   => "عرض المشروع",
    ],

    "roles" => [
        'index'  => 'الأدوار و الصلاحيات',
        "create" => "إضافة دور جديد",
        "edit"   => "تعديل الدور",
        "show"   => "عرض الدور",
    ],

    "tasks" => [
        'index'  => 'المهام',
        "create" => "إضافة مهمة جديدة",
        "edit"   => "تعديل المهمة",
        "show"   => "عرض المهمة",
    ],

    "clients" => [
        'index'  => 'العملاء',
        "create" => "إضافة عميل جديد",
        "edit"   => "تعديل العميل",
        "show"   => "عرض العميل",
    ],

    "categories" => [
        'index' => 'الفئات',
        "create" => "إضافة فئة جديدة",
        "edit" => "تعديل الفئة",
        "show" => "عرض الفئة"
    ],

    "shipments" => [
        'index'  => 'الشحنات',
        "create" => "إضافة شحنة جديدة",
        "edit"   => "تعديل الشحنة",
        "show"   => "عرض الشحنة"
    ],

    "fixedPages" => [
        'index' => 'الصفحات الثابتة',
        "create" => "إضافة صفحة ثابتة جديدة",
        "edit" => "تعديل الصفحة الثابتة",
        "show" => "عرض الصفحة الثابتة"
    ],

    "products" => [
        'index' => 'المنتجات',
        "create" => "إضافة منتج جديد",
        "edit" => "تعديل المنتج",
        "show" => "عرض المنتج"
    ],

    "sliders" => [
        'index' => 'الشرائح',
        "create" => "إضافة شريحة جديدة",
        "edit" => "تعديل الشريحة",
        "show" => "عرض الشريحة"
    ],

    "socials" => [
        'index' => 'وسائل التواصل الاجتماعي',
        "create" => "إضافة وسيلة تواصل جديدة",
        "edit" => "تعديل وسيلة التواصل",
        "show" => "عرض وسيلة التواصل"
    ],

    "en" => "English",
    "ja" => "日本語",
    "ar" => "العربية",

];
